In [10]:
import numpy as np
import pandas as pd

In [11]:
df = pd.read_pickle('../Data/SampleData.pkl')
df.head(3)

   FloatNumbers  Integers SomeStrings       Time
0   1963.969532    843904  gbrsDbZjjn 2005-01-11
1  52607.513266    941076  XdXlQxlEbi 1994-12-10
2  88004.983548    649651  YeBLjocGjg 2013-05-28

#### Sample

In [12]:
s1 = df.sample(n=5)
s2 = df.sample(frac=0.2)
print(len(df), len(s1), len(s2))

10000 5 2000

#### Normalize

In [13]:
def normalize_df(generic_df, verbose=False):
    df = generic_df.copy()
    u = generic_df.mean(numeric_only=True)
    var = generic_df.std(numeric_only=True)
    numerics = u.index.values
    for col in generic_df:
        if col not in numerics:
            continue
        df[col] = (generic_df[col] - u[col]) / var[col]
    if verbose:
        return df, [u, var]
    return df

# For numeric-only-df: df_norm = (df - df.mean()) / df.std()

df_norm = normalize_df(df)
df_norm.describe().transpose()

,count,mean,std,min,25%,50%,75%,max
FloatNumbers,10000.0,-7.318590e-17,1.0,-1.127249,-0.820711,-0.283182,0.560088,3.402614
Integers,10000.0,1.563194e-17,1.0,-1.708011,-0.879742,-0.000588,0.867762,1.725758

#### Grouping

In [18]:
df['label1'] = np.random.randint(0, 2, len(df))
df['label2'] = np.random.randint(0, 3, len(df))
df.head(3)

   FloatNumbers  Integers SomeStrings       Time  label1  label2
0   1963.969532    843904  gbrsDbZjjn 2005-01-11       1       1
1  52607.513266    941076  XdXlQxlEbi 1994-12-10       1       0
2  88004.983548    649651  YeBLjocGjg 2013-05-28       1       2

In [22]:
strings_per_group = df.groupby(['label1', 'label2']).SomeStrings.apply(list).reset_index()  # Reset to remove multi-index
strings_per_group.head()

   label1  label2                                        SomeStrings
0       0       0  [DQbhnbjhRl, PBJMYZKvtd, MTsgIWEsaQ, tybkbFFjV...
1       0       1  [XHLkMESXGQ, lFWGznPyyJ, MvQOxltuZG, pMTLfkpjB...
2       0       2  [IRlhYndcRj, kSKyHicUlr, GsxrHGCPCp, VEQkCKjRL...
3       1       0  [XdXlQxlEbi, jQJlGwdJSi, YsDhMrkgMG, ZlTwMORNr...
4       1       1  [gbrsDbZjjn, epTjgzIUwe, gxzvvkpSSZ, rsBJxXCFd...

In [28]:
average_per_label = df.groupby(['label1', 'label2']).FloatNumbers.mean().reset_index()
average_per_label.head()

   label1  label2   FloatNumbers
0       0       0  245170.305554
1       0       1  252153.205493
2       0       2  250518.478167
3       1       0  249006.700085
4       1       1  246741.388831